SIMISA@@@@@@@@@@JINX0D0t______
 
Wagon ( DR_BR_4MT_76016
    Type ( Engine )
    WagonShape ( DR_BR_4MT_76017.s )
    Size  ( 2.634m 4.151m 9.678m )

Include ( ..\\Common_Locomotives\\BR_4MT_260_wagon.inc )

Comment ( ********************* Wagon Visual Effects *********************
                      Included in this section - Effect type, etc
          *********************************************************************** )

Effects(
SpecialEffects(
Comment(==== Steam Heating Hose Leak ====)
HeatingHoseFX(
0.3 0.6 4.5
0 1 0
0.16 )
 ))

Comment ( ******************** Freight and Load Animations (If used) ********************
                Included in this section - Freight Animation information, etc
          *********************************************************************** )
ORTSFreightAnims (
MSTSFreightAnimEnabled (1)
FreightAnimStatic
(
SubType (Default)
Shape(  "..\\common.crew\\Animated\\fire1.s" )
Offset( 0 2.5 3.3 )
FreightWeight(0.01t)
Visibility ( "Cab3D" )
)
FreightAnimStatic
(
SubType (Default)
Shape( "..//common.crew//Animated//fireman1.s" )
Offset( 0.8 2.87 4.6 )
FreightWeight(0.01t)
Visibility ( "Outside,Cab3D" )
)
FreightAnimStatic
(
SubType (Default)
Shape( "..//common.crew//Animated//Driver_Bill.s" )
Offset( -0.9 1.62 4.6 )
FreightWeight(0.01t)
Visibility ( "Outside" )
)
)
)

    Engine ( DR_BR_4MT_76016

Effects(
SteamSpecialEffects (

WhistleFX (
0.0 3.791 -2.921
0 -0.1 1.05
0.3 )

SafetyValvesFX (
0 3.752 -2.413
0 0.95 0
0.2 )

SafetyValvesFX (
0 3.752 -2.413
0 -0.8 0
0.35 )

StackFX (
0 3.947 2.569
0 0.95 0
0.3 )
StackFX (
0 3.947 2.569
0 0.95 0
0.25 )
StackFX (
0 3.947 2.569
0 0.95 0
0.25 )
			
DrainpipeFX (
-1.5 1.258 -3.886
-0.4 -1 -0.2
0.05 )

CylindersFX (
-0.972 0.801 3.204
0 -0.4 1.4
0.1 )
CylindersFX (
0.972 0.801 3.204
0 -0.4 1.4
0.1 )
Cylinders2FX (
-0.972 0.799 3.200
0 -0.4 1.4
0.1 )
Cylinders2FX (
-0.972 0.799 3.200
0 -0.4 1.4
0.1 )

Injectors1FX (
1.00 0.34 -4.60
0 -1 -1
0.1 )
Injectors2FX (
-1.00 0.34 -4.60
0 -1 -1
0.1 )

LargeEjectorFX (
 -0.98 2.65 -2.70
 0.2 1 -0.2
 0.05 )
LargeEjectorFX (
 -0.98 2.60 -2.70
 -0.2 -1 -0.2
 0.10 )
LargeEjectorFX (
 -1.10 1.98 -2.70
 -0.5 -1.0 0
 0.15 )

SmallEjectorFX (
 -0.98 2.60 -2.70
 -0.4 -0.6 -0.2
 0.05 )
SmallEjectorFX (
 -1.10 1.98 -2.70
 -0.5 -1.0 0
 0.10 )

SteamBrakeFX (
 0.65 0.60 -4.6
 0 -1 0
 0.05 )
SteamBrakeFX (
 -0.65 0.60 -4.6
 0 -1 0
 0.05 )

 ) )

Include ( ..\\Common_Locomotives\\BR_4MT_260_engine.inc )

    HeadOut ( -1.427 4.094 -4.548 )

      Name ( "DR_BR_4MT_76016" )

    Description (
        "British Rail Standard Class4 2-6-0 Tender engine number 76016.\n"+
        "\n"+
        "(c) \n"+
        " \n"
    )
    EngineOperatingProcedures (
        "The operating procedures for the engine.\n"+
        " \n"
    )
)